package com.goudong.oauth2.enumerate;

/**
 * 枚举描述：
 * 认证日志中的类型
 * @author msi
 * @version 1.0
 * @date 2022/2/4 12:31
 */
public enum AuthenticationLogTypeEnum {

    //~fields
    //==================================================================================================================
    /**
     * 系统用户
     */
    SYSTEM,
    /**
     * qq
     */
    QQ,
    /**
     * 微信
     */
    WEI_XIN,
    ;
    //~methods
    //==================================================================================================================

}